; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_1 ?v6 - type_1 ?v1 - type_3)
 	      (pred_4 ?v4 - object ?v1 - type_3)
	      (pred_3 ?v6 - type_1 ?v8 - type_2)
	      (pred_2 ?v6 - type_1 ?v4 - object ?v8 - type_2))

   (:action op_3
       :parameters  (?v6 - type_1 ?v2 ?v3 - type_3)
       :precondition (and  (pred_1 ?v6 ?v2))
       :effect (and  (pred_1 ?v6 ?v3)
		     (not (pred_1 ?v6 ?v2))))

   (:action op_2
       :parameters (?v6 - type_1 ?v7 - object ?v5 - type_3 ?v8 - type_2)
       :precondition  (and  (pred_4 ?v7 ?v5) (pred_1 ?v6 ?v5) (pred_3 ?v6 ?v8))
       :effect (and (pred_2 ?v6 ?v7 ?v8)
		    (not (pred_4 ?v7 ?v5)) 
		    (not (pred_3 ?v6 ?v8))))

   (:action op_1
       :parameters (?v6 - type_1 ?v7 - object ?v5 - type_3 ?v8 - type_2)
       :precondition  (and  (pred_2 ?v6 ?v7 ?v8) (pred_1 ?v6 ?v5))
       :effect (and (pred_4 ?v7 ?v5)
		    (pred_3 ?v6 ?v8)
		    (not (pred_2 ?v6 ?v7 ?v8)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_12 obj_11 - type_1
obj_05 obj_10 obj_08 obj_13 - type_2
obj_09 obj_07 obj_01 obj_04 - type_3
obj_02 obj_06 obj_03 - object)
(:init
(pred_1 obj_12 obj_01)
(pred_3 obj_12 obj_05)
(pred_3 obj_12 obj_10)
(pred_1 obj_11 obj_01)
(pred_3 obj_11 obj_08)
(pred_3 obj_11 obj_13)
(pred_4 obj_02 obj_09)
(pred_4 obj_06 obj_01)
(pred_4 obj_03 obj_01)
)
(:goal
(and
(pred_4 obj_02 obj_01)
(pred_4 obj_06 obj_04)
(pred_4 obj_03 obj_09)
)
)

(:constraints
  (always (not (pred_1 obj_12 obj_09)))
)
)

; plan
1. (op_2 obj_11 obj_06 obj_01 obj_13)
   deleted: (pred_4 obj_06 obj_01) (pred_3 obj_11 obj_13)
   added: (pred_2 obj_11 obj_06 obj_13)
   goals met: 0 of 3
2. (op_2 obj_12 obj_03 obj_01 obj_10)
   deleted: (pred_4 obj_03 obj_01) (pred_3 obj_12 obj_10)
   added: (pred_2 obj_12 obj_03 obj_10)
   goals met: 0 of 3
3. (op_3 obj_11 obj_01 obj_04)
   deleted: (pred_1 obj_11 obj_01)
   added: (pred_1 obj_11 obj_04)
   goals met: 0 of 3
4. (op_1 obj_11 obj_06 obj_04 obj_13)
   deleted: (pred_2 obj_11 obj_06 obj_13)
   added: (pred_4 obj_06 obj_04) (pred_3 obj_11 obj_13)
   goals met: 1 of 3
5. (op_3 obj_11 obj_04 obj_09)
   deleted: (pred_1 obj_11 obj_04)
   added: (pred_1 obj_11 obj_09)
   goals met: 1 of 3
6. (op_2 obj_11 obj_02 obj_09 obj_13)
   deleted: (pred_4 obj_02 obj_09) (pred_3 obj_11 obj_13)
   added: (pred_2 obj_11 obj_02 obj_13)
   goals met: 1 of 3
7. (op_3 obj_11 obj_09 obj_01)
   deleted: (pred_1 obj_11 obj_09)
   added: (pred_1 obj_11 obj_01)
   goals met: 1 of 3
8. (op_1 obj_11 obj_02 obj_01 obj_13)
   deleted: (pred_2 obj_11 obj_02 obj_13)
   added: (pred_4 obj_02 obj_01) (pred_3 obj_11 obj_13)
   goals met: 2 of 3
9. (op_1 obj_12 obj_03 obj_01 obj_10)
   deleted: (pred_2 obj_12 obj_03 obj_10)
   added: (pred_4 obj_03 obj_01) (pred_3 obj_12 obj_10)
   goals met: 2 of 3
10. (op_2 obj_11 obj_03 obj_01 obj_13)
   deleted: (pred_4 obj_03 obj_01) (pred_3 obj_11 obj_13)
   added: (pred_2 obj_11 obj_03 obj_13)
   goals met: 2 of 3
11. (op_3 obj_11 obj_01 obj_09)
   deleted: (pred_1 obj_11 obj_01)
   added: (pred_1 obj_11 obj_09)
   goals met: 2 of 3
12. (op_1 obj_11 obj_03 obj_09 obj_13)
   deleted: (pred_2 obj_11 obj_03 obj_13)
   added: (pred_4 obj_03 obj_09) (pred_3 obj_11 obj_13)
   goals met: 3 of 3
